test_ab/test_ab_n3000_c50.txt
================= Mem Java =================
  RSS
244788

================= Threads =================
Total live threads: 19

================= Test AB =================
This is ApacheBench, Version 2.3 <$Revision: 1430300 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 3.19.217.251 (be patient)


Server Software:        
Server Hostname:        3.19.217.251
Server Port:            8080

Document Path:          /api/auth
Document Length:        24 bytes

Concurrency Level:      50
Time taken for tests:   5.220 seconds
Complete requests:      3000
Failed requests:        0
Write errors:           0
Total transferred:      309000 bytes
HTML transferred:       72000 bytes
Requests per second:    574.70 [#/sec] (mean)
Time per request:       87.001 [ms] (mean)
Time per request:       1.740 [ms] (mean, across all concurrent requests)
Transfer rate:          57.81 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    6   4.1      5      16
Processing:    14   80  12.4     80     134
Waiting:       13   80  12.3     80     134
Total:         15   86  13.7     86     145

Percentage of the requests served within a certain time (ms)
  50%     86
  66%     90
  75%     93
  80%     96
  90%    106
  95%    112
  98%    121
  99%    127
 100%    145 (longest request)

================= Threads =================
Total live threads: 19

================= Mem Java =================
  RSS
244788